#+STARTUP:   indent
#+TITLE:     Introduction to R
#+AUTHOR:    G. Jay Kerns
#+EMAIL:     gkerns@ysu.edu
#+DATE:      2011-09-18 Sun
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

*** Arithmetic
\label{sub:Arithmetic}

#+begin_src R :exports both :results output pp  
2 + 3       # add
4 * 5 / 6   # multiply and divide
7^8         # 7 to the 8th power
#+end_src

Notice the comment character =#=\index{#@\texttt{\#}}. Anything typed after a =#= symbol is ignored by \textsf{R}. We know that \(20/6\) is a repeating decimal, but the above example shows only 7 digits. We can change the number of digits displayed with =options=\index{options@\texttt{options}}:

#+begin_src R :exports both :results output pp 
options(digits = 16)
10/3                 # see more digits
sqrt(2)              # square root
exp(1)               # Euler's constant, e
pi       
options(digits = 7)  # back to default
#+end_src

#+results[6f6d7c9b7a0784d99109913def5c02796093d448]:
: [1] 3.333333333333333
: [1] 1.414213562373095
: [1] 2.718281828459045
: [1] 3.141592653589793

Note that it is possible to set =digits=\index{digits@\texttt{digits}} up to 22, but setting them over 16 is not recommended (the extra significant digits are not necessarily reliable). Above notice the =sqrt=\index{sqrt@\texttt{sqrt}} function for square roots and the =exp=\index{exp@\texttt{exp}} function for powers of \(\mathrm{e}\), Euler's number.


